DaniMzT/MyProjects_STM32NucleoF091/Train/Src/train_LCD_timers.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body #2 (LEDs+Buttons+SPI with Arduino as slave and just printing)
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2022 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
#include <string.h> //because I want to use memset to initialize the handles to 0, strncpy and strncat
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include "stm32f091rct6.h"

/*to debug with printf */
//extern void initialise_monitor_handles(void);

#if !defined(__SOFT_FP__) && defined(__ARM_FP)
  #warning "FPU is not initialized, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif

/*PORTS USED:PA0,1,9,10(LEDs);PB3,5(BUTTONS);PA4-7(SPI);PB6,9(I2C)
*2 buttons causing interruptions: OnOff(PB3) and Emergency(PB5). 4 LEDs */

//GPIO_PinHandle_t butOnOff, butEmerg, led0, led1, led2, led3;
GPIO_PinHandle_t buttons, leds, spiGPIOs, i2cGPIOs;
#define PIN_LED0 0
#define PIN_LED1 1
#define PIN_LED2 9 //PA2 TX? it seems not to work when debugging
#define PIN_LED3 10 //PA3 RX? it seems not to work when debugging
#define PIN_BUTTON_OFFON 3
#define PIN_BUTTON_EMERGENCY 5

/*SPI handle*/
SPI_Handle_t spi1;
#define PIN_SPI1_NSS 4
#define PIN_SPI1_SCK 5
#define PIN_SPI1_MISO 6
#define PIN_SPI1_MOSI 7

/*SPI communication with an Arduino (aka Ard).Whenever state changes, send it*/
//Commands
#define SPI_COMMAND_PRINT  	0x50
#define SPI_COMMAND_LED		0x51
/*Notes:in SPI comm slave will not initiate the data transfer.We send a command to Ard,Ard reads it,puts ACK/NACK.
*When the command is sent to Ard,Ard RX buffer saves this and puts an ACK/NACK in its TX.During command transmission,
*master has received garbage bytes from Ard.So before requesting ACK/NACK,we need to clear off master RX by reading.Now we can get
*Ard's ACK/NACK by sending dummy data*/
#define SPI_ARD_ACK		0xA1
#define SPI_ARD_NACK	0xB1
#define SPI_ARD_DUMMY	0xC1

/* I need just one byte for the RX buffer. For TX,I use TX_byte when 1 byte and then message_spi*/
uint8_t myRXbuffer;
uint8_t TX_byte = SPI_ARD_DUMMY; //dummy byte for SPI
enum stateSPI{SEND_PRINT,READ_PRINT,DUMMY_ACK,READ_ACK,SEND_LENGTH,READ_LENGTH,SEND_STATE,READ_STATE,WAIT_END};
enum stateSPI flagSPI = SEND_PRINT;

/*I2C handle*/
I2C_Handle_t i2c1;
#define PIN_I2C1_SCL 6
#define PIN_I2C1_SDA 9
#define ADS1115_ADDRESS 0x48 //0x48 is address of ADS1115 when ADDR connected to GND
#define ADS1115_CONVERSION_REGISTER_BYTES 2

//I2C related
uint8_t restart_I2C = 1; //flag to enable/disable restart.Changed from callbacks
uint16_t lastADS1115_raw = 0;
uint16_t lastADS1115_mV = 0;
#define ADS1115_GAIN 4076 //Gain amplifier in mV, check ADS1115 datasheet
#define ADS1115_MAX 32768 //15 bytes
uint8_t bytes_to_ADS1115_reg[3] = {0x00,0x00,0x00}; //for ADS1115 configuration (it can require 3 bytes)
uint8_t bytes_from_ADS1115[2] = {0x00,0x00}; //data received from ADS1115 (conversion register)
enum stateADS1115{ADS1115_NOT_STARTED,ADS1115_1ST_DURING,ADS1115_1ST_DONE,ADS1115_2ND_DURING,ADS1115_CONFIGURED};
enum stateADS1115 flagADS1115 = ADS1115_NOT_STARTED;
uint8_t startRX = 0; //boolean to know if START (Address+read bit) has been sent for receiving ADS1115
/*uint16_t testCounter_measurements = 0;
#define I2C_MAX_MEASUREMENTS	5 //limit of I2C measurements (testing) */

//Timers
BasicTimer_Handle_t timer7; //timer for I2C periodical reading (temperature sensor)
VirtualBasicTimer_t train_virtualTimer; //virtual timer simulating automatic train (linked to timer 7, with a shorter period)

//Related to the application
enum state{OFF,ON,EMERGENCY};
enum state currentState = OFF;
uint8_t stateChanged = 0; //0 if the state changes; 1 if it changes
uint8_t trainStation = 0;
enum train_directions {LEFT,RIGHT};
enum train_directions trainDirection = RIGHT;
#define TRAIN_STATIONS 25
const char* station_string = "Station:";
const char* state_string = ".State:";
const char* state_string_names[] = {"OFF","ON","EMERGENCY"};
#define LCD_CHARS 32 //number of chars LCD can display
char message_spi[LCD_CHARS]; //message sent to Arduino for LCD.Better wo dynamic allocation as we know max size + malloc would take time in functions
char station_char;
//char* state_name = malloc(sizeof(state_string_names[2]));
uint8_t message_spi_length = LCD_CHARS; //the length of the message to be sent via spi, although the real size of message_spi is LCD_CHARS

/*NOT USED BECAUSE STRING.H IS INCLUDED
int stringLength(char *charSt){ //to know the length of a string instead of using external functions
	int length = 0;
	char *pointer = charSt; //to avoid modifying charSt
	while (*pointer!='\0'){ //'\0'end
		length++;
		pointer++;
	}
	return length;
}
*/

void delay(uint32_t timeDelayed)
{
	// some delay for the debouncing of the buttons
	for(uint32_t i = 0 ; i < timeDelayed ; i ++);//SPI,GPIO too?: 300000/2 working in old PC. in new PC, so far 1000000/2 mostly
}

//Configurations and initializations
void peripheral_Config_Ini(void);

//flush DR SPI
void flushDR(SPI_Handle_t *pSPIhandle, volatile uint8_t *rxbuffer, uint8_t length);

//STM32-Arduino SPI communication for this application
void spi_appComm();

//configure ADS1115 registers
void configureADS1115(I2C_Handle_t *pI2Chandle);

/**********************************************START MAIN********************************************************************/
int main(void)
{
	//initialise_monitor_handles(); //for debugging in IDE
	//printf("THIS STARTS\n");

	//initialize structures to 0 to avoid garbage values
	memset(&buttons,0,sizeof(buttons));
	memset(&leds,0,sizeof(leds));

	/*GPIOs for the SPI handled by spiGPIO -->SPI1 PA4:NSS PA4:SCK PA4:MISO PA4:MOSI. sp1 is the handle for SPI1*/
	memset(&spiGPIOs,0,sizeof(spiGPIOs));
	memset(&spi1,0,sizeof(spi1));

