DaniMzT/MyProjects_STM32NucleoF091/Train/Src/train_LCD_timers.c
    //enable the interrupt again if disabled previously
    //BasicTimer_EnableDisable(&timer7, ENABLE);
}

/**********************************************END IRQ********************************************************************/

/*****************************Configurations and initializations************************************************************/
void peripheral_Config_Ini(void){

	//local variables
	uint8_t param1, param2, param3, param4, param5;
	/**********************LEDS***********************************************/
	//LED0. PA0
	leds.pGPIO = GPIOA;
	leds.GPIO_PinConfig.GPIO_PinNumber = PIN_LED0;
	leds.GPIO_PinConfig.GPIO_PinMode = GPIO_OUT;
	leds.GPIO_PinConfig.GPIO_PinOutType = GPIO_PUSHPULL;
	leds.GPIO_PinConfig.GPIO_PinOutSpeed = GPIO_SLOWSPEED; //GPIO_MEDIUMSPEED
	leds.GPIO_PinConfig.GPIO_PinPullUpDown = GPIO_NOPULL;
	//Initialization LED0
	GPIO_PinInit(&leds);

	//LED1.PA1.Port,Mode,OutType,OutSpeed and PullUpDown same as LED0
	leds.GPIO_PinConfig.GPIO_PinNumber = PIN_LED1;
	//Initialization LED1
	GPIO_PinInit(&leds);

	//LED2.PA9.Port,Mode,OutType,OutSpeed and PullUpDown same as LED0
	leds.GPIO_PinConfig.GPIO_PinNumber = PIN_LED2;
	//Initialization LED2
	GPIO_PinInit(&leds);

	//LED3.PA10.Port,Mode,OutType,OutSpeed and PullUpDown same as LED0
	leds.GPIO_PinConfig.GPIO_PinNumber = PIN_LED3;
	//Initialization LED3
	GPIO_PinInit(&leds);

	//LEDs OFF
	GPIO_WritePin(GPIOA,PIN_LED0,1);
	GPIO_WritePin(GPIOA,PIN_LED1,0);
	GPIO_WritePin(GPIOA,PIN_LED2,0);
	GPIO_WritePin(GPIOA,PIN_LED3,1);

	/***************************************BUTTONS********************************/
	//BUTTON ON-OFF. PB3
	buttons.pGPIO = GPIOB;
	buttons.GPIO_PinConfig.GPIO_PinNumber = PIN_BUTTON_OFFON;
	buttons.GPIO_PinConfig.GPIO_PinMode = GPIO_FALL_TRIG; //interrupt falling edge
	buttons.GPIO_PinConfig.GPIO_PinPullUpDown = GPIO_PULLUP; //pull up (3.3 by default)
	//initialization button on-off
	GPIO_PinInit(&buttons);

	//EMERGENCY BUTTON. PB5
	buttons.pGPIO = GPIOB;
	buttons.GPIO_PinConfig.GPIO_PinNumber = PIN_BUTTON_EMERGENCY;
	buttons.GPIO_PinConfig.GPIO_PinMode = GPIO_FALL_TRIG;
	buttons.GPIO_PinConfig.GPIO_PinPullUpDown = GPIO_PULLUP;
	//initialization emergency button
	GPIO_PinInit(&buttons);

	/**************************************SPI***********************************/
	//GPIOs for SPI: SPI1 PA4:NSS PA5:SCK PA6:MISO PA7:MOSI. Alternate function AF0
	spiGPIOs.pGPIO = GPIOA;
	spiGPIOs.GPIO_PinConfig.GPIO_PinMode = GPIO_ALTFUN;
	spiGPIOs.GPIO_PinConfig.GPIO_PinAlterFunc = GPIO_AF0;
	spiGPIOs.GPIO_PinConfig.GPIO_PinOutType = GPIO_PUSHPULL;
	spiGPIOs.GPIO_PinConfig.GPIO_PinOutSpeed = GPIO_HIGHSPEED; //FAST SPEED
	spiGPIOs.GPIO_PinConfig.GPIO_PinPullUpDown = GPIO_NOPULL;
	//SCK
	spiGPIOs.GPIO_PinConfig.GPIO_PinNumber = PIN_SPI1_SCK;//SCK
	GPIO_PinInit(&spiGPIOs);

	spiGPIOs.GPIO_PinConfig.GPIO_PinPullUpDown = GPIO_PULLUP;
	//NSS
	spiGPIOs.GPIO_PinConfig.GPIO_PinNumber = PIN_SPI1_NSS;//NSS
	GPIO_PinInit(&spiGPIOs);
	//MISO
	spiGPIOs.GPIO_PinConfig.GPIO_PinNumber = PIN_SPI1_MISO;//MISO
	GPIO_PinInit(&spiGPIOs);
	//MOSI
	spiGPIOs.GPIO_PinConfig.GPIO_PinNumber = PIN_SPI1_MOSI;//MOSI
	GPIO_PinInit(&spiGPIOs);

	/*SPI handle configuration and initialization*/
	//SPI configuration
	spi1.pSPI = SPI1_I2S1;
	spi1.SPI_Config.SPI_Mode = SPI_MASTER;
	spi1.SPI_Config.SPI_Speed = SPI_SPEED_2;
	spi1.SPI_Config.SPI_CommType = SPI_FULLDUPLEX;
	spi1.SPI_Config.SPI_DataSize = SPI_8BIT;
	spi1.SPI_Config.SPI_SWslave = SPI_HW_MGMT;
	spi1.SPI_Config.SPI_Pol = SPI_CLK_IDLE_0;
	spi1.SPI_Config.SPI_Phase = SPI_CLK_CAPT_FIRST;

	//SPI initialization
	SPI_Init(&spi1);

	//Set SSOE to 1 to make NSS output enable
	SPI_SSOE(&spi1,ENABLE);

	//Enable SPI peripheral
	SPI_EnableDisable(&spi1,ENABLE);

	/**********************************I2C*****************************************/
	//GPIOs for I2C: PB6(SCL), PB9(SDA).Alternate function AF1!
	i2cGPIOs.pGPIO = GPIOB;
	i2cGPIOs.GPIO_PinConfig.GPIO_PinMode = GPIO_ALTFUN;
	i2cGPIOs.GPIO_PinConfig.GPIO_PinAlterFunc = GPIO_AF1;
	i2cGPIOs.GPIO_PinConfig.GPIO_PinOutType = GPIO_PUSHPULL;
	i2cGPIOs.GPIO_PinConfig.GPIO_PinOutSpeed = GPIO_HIGHSPEED; //FAST SPEED
	i2cGPIOs.GPIO_PinConfig.GPIO_PinPullUpDown = GPIO_PULLUP; //internal pull up
	//SCL
	i2cGPIOs.GPIO_PinConfig.GPIO_PinNumber = PIN_I2C1_SCL;//SCL
	GPIO_PinInit(&i2cGPIOs);
	//SDA
	i2cGPIOs.GPIO_PinConfig.GPIO_PinNumber = PIN_I2C1_SDA;//SDA
	GPIO_PinInit(&i2cGPIOs);

	/*I2C configuration*/
	i2c1.pI2C = I2C1;
	//timing according to table for 100kHz I2C,8MHz clock
	param1 = 0x01;//PRESC
	param2 = 0x04;//SCLDEL
	param3 = 0x02;//SDADEL
	param4 = 0x0F;//SCLH
	param5 = 0x13;//SCLL
	I2C_Master_TimingR(&i2c1, param1, param2, param3, param4, param5);
	i2c1.I2C_Config.I2C_AddressMode = I2C_ADDRESS_MODE_7BIT;
	i2c1.I2C_Comm_t.I2C_SlaveAddress = ADS1115_ADDRESS; //ADS1115 address
	i2c1.I2C_Comm_t.I2C_Nbytes = 1;
	i2c1.I2C_Comm_t.RX_length = 1;
	i2c1.I2C_Comm_t.I2C_RepeatStart = I2C_AUTOEND;

	//I2C initialization
	I2C_Init(&i2c1);
	//Enable I2C peripheral
	I2C_EnableDisable(&i2c1,ENABLE);

	/********************************TIMERS******************************************/
	//Timer 7 configuration
	timer7.pBasicTimer = BASIC_TIMER_7;
	timer7.BasicTimer_Config.BasicTimer_arpe = DISABLE; //0: autoreload ARR updated if changed
	timer7.BasicTimer_Config.BasicTimer_opm = DISABLE; //0: counter not stopped at update event
	timer7.BasicTimer_Config.BasicTimer_urs = ENABLE; //1: only overflow for interrupts
	timer7.BasicTimer_Config.BasicTimer_udis = DISABLE;
	//freq:8MHz.I2C meas/20s(real app:1min).Train stations/5s(simulation;reality with motor.timer tick:150Hz(min:8MHz/FFFF=133).arr:20s
	timer7.BasicTimer_Config.BasicTimer_prescaler = 53332; //prescaler=(clock_freq/timerTick_freq)-1=53332 (0xD054)
	timer7.BasicTimer_Config.BasicTimer_autoreload = 3000; //max value. 20s/(1/150)=3000 (0xBB8)

	//Timer 7 initialization
	BasicTimer_Init(&timer7);
	//Enable timer 7
	BasicTimer_EnableDisable(&timer7, ENABLE);

	//Virtual timer configuration, here used for
	train_virtualTimer.realTimer = timer7;
	train_virtualTimer.configured_counter_value = (train_virtualTimer.realTimer.BasicTimer_Config.BasicTimer_autoreload/4);
	train_virtualTimer.counter_value_preStop = 0;
	if (currentState == ON){
		VirtualBasicTimer_EnableDisable(&train_virtualTimer, ENABLE); //it does not start the virtual timer yet
		VirtualBasicTimer_StartCounter(&train_virtualTimer); //virtual timer starts
	}

