DaniMzT/MyProjects_STM32NucleoF091/Train/Src/train_LCD_timers.c
}
/*********************************CONFIGURE ADS1115**********************************************/
void configureADS1115(I2C_Handle_t *pI2Chandle){
	//https://cdn-shop.adafruit.com/datasheets/ads1115.pdf
	if (flagADS1115 < ADS1115_1ST_DURING){
		//continuous mode
		/*1-write to config reg. bit 8 mode(0:continuous;1:single-shot,default);bits 9-11:gain amplifier.bit 15 set to 1 starts single shot
		*bits 14-12:multiplexor configuration
		*transmiter:address+0x01(points to config reg)+0b10000100(MSB:start shot+default gain+continuous)+0b10000011(LSB:default rate+no comparator)*/
		bytes_to_ADS1115_reg[0] = 0x01; //0x01(points to config reg)

		//for continuous mode. +-4.076V, 128 sps, bits 14-12 110: AINp=AIN0 and AInn=GND (single ended measurement for A0).
		//bytes_to_ADS1115_reg[1] = 0xC2; //0b11000010 (MSB)
		//bytes_to_ADS1115_reg[2] = 0x83; //0b10000011 (LSB)
		//for single-shot. bit 15: begin single conversion. bit 8: 1-single shot
		bytes_to_ADS1115_reg[1] = 0xC3; //0b11000011 (MSB)
		bytes_to_ADS1115_reg[2] = 0x83; //0b10000011 (LSB)

		//pI2Chandle->I2C_Comm_t.TX_buffer = bytes_to_ADS1115_reg; //buffer pointing to bytes_to_ADS1115_reg
		flagADS1115 = ADS1115_1ST_DURING;
		I2C_EnableDisable(&i2c1,ENABLE);
		I2C_Master_Transmitter(pI2Chandle, 3, 1, bytes_to_ADS1115_reg);
		//I2C_Start(pI2Chandle); //triggered directly in I2C_Master_Transmitter;in case of problems,do it from here and comment in I2C_Master_Transmitter
	}


	if (flagADS1115 == ADS1115_1ST_DONE){
		//2-select the conversion register by writing to pointer reg(0x00:conversion reg;0x01:config reg)
		//transmitter:address+0x00(points to conversion register)
		bytes_to_ADS1115_reg[0] = 0x00; //0x00(points to conversion register)
		//pI2Chandle->I2C_Comm_t.TX_buffer = bytes_to_ADS1115_reg; //buffer pointing to bytes_to_ADS1115_reg
		flagADS1115 = ADS1115_2ND_DURING;
		//I2C_EnableDisable(&i2c1,ENABLE);
		I2C_Master_Transmitter(pI2Chandle, 1, 1, bytes_to_ADS1115_reg);
		//I2C_Start(pI2Chandle); //triggered directly in I2C_Master_Transmitter;in case of problems,do it from here and comment in I2C_Master_Transmitter
	}

}

/************************************SPI COMMUNICATION STM32-ARDUINO************************************/
void spi_appComm(){
	//switch-case instead of while (TX/RXstate != READ) to avoid blocking
	switch (flagSPI){ //{SEND_PRINT,READ_PRINT,DUMMY_ACK,READ_ACK,SEND_LENGTH,READ_LENGTH,SEND_STATE,READ_STATE}
	case SEND_PRINT:
		//create the message (alternative:create it in case SEND_LENGTH,but maybe modify the startCounter placement)
	    station_char = trainStation+'0';
	    //state_name = state_string_names[currentState];
	    //message_spi[0] = '\0';//to clear the array,since '\0' represents the last element of a char array
	    strlcpy(message_spi,station_string,strlen(station_string));
	    strncat(message_spi,&station_char,strlen(&station_char));
	    strncat(message_spi,state_string,strlen(state_string));
	    strncat(message_spi,state_string_names[currentState],strlen(state_string_names[currentState]));
	    message_spi_length = strlen(station_string)+strlen(&station_char)+strlen(state_string)+strlen(state_string_names[currentState])-1;

		//enable SPI and disable it at the end
		SPI_EnableDisable(&spi1,ENABLE);
		//Reading data register to flush previous data (previously it had been working without this)
		//NOT IMPLEMENTED;IF NECESSARY,COPY FROM debugSemihosting: flushDR(&spi1, &myRXbuffer, 1);

		//Send print command.Ard should store it in its RX buffer and put ACK in TX.Master should receive garbage in shift reg.
		TX_byte = SPI_COMMAND_PRINT;
		SPI_Send(&spi1, &TX_byte, 1); //SPI_Send(&spi1, (uint8_t*)SPI_COMMAND_PRINT, 1);
		flagSPI = READ_PRINT;
		break;

	case READ_PRINT://Read master RX to clear the RX buffer for the next reading of ACK
		if (spi1.SPI_Comm.TX_state == SPI_READY){
			delay(500000);
			SPI_Read(&spi1, &myRXbuffer, 1); //1 byte to be read
			flagSPI = DUMMY_ACK;
		}
		break;

	case DUMMY_ACK://Send dummy data to Ard so that master receives ACK/NACK
		if (spi1.SPI_Comm.RX_state == SPI_READY){
			delay(500000);
			TX_byte = SPI_ARD_DUMMY;
			SPI_Send(&spi1, &TX_byte, 1); //length 1 byte
			flagSPI = READ_ACK;
		}
		break;

	case READ_ACK://Read master RX to get ACK/NACK
		if (spi1.SPI_Comm.TX_state == SPI_READY){
			delay(500000);
			SPI_Read(&spi1, &myRXbuffer, 1); //1 byte to be read
			flagSPI = SEND_LENGTH;
		}
		break;

	case SEND_LENGTH://if ACK, send length+currentState and receive response;otherwise,send it again
		if (spi1.SPI_Comm.RX_state == SPI_READY){
			delay(500000);
			if (myRXbuffer == SPI_ARD_ACK){
				TX_byte = message_spi_length; //in bytes. test: 0x01
				SPI_Send(&spi1, &TX_byte, 1);
				flagSPI = READ_LENGTH;
			}
			else {
				//try to send it again
				flagSPI = SEND_PRINT;
			}
		}
		break;

	case READ_LENGTH://Read master RX
		if (spi1.SPI_Comm.TX_state == SPI_READY){
			delay(500000);
			SPI_Read(&spi1, &myRXbuffer, 1); //1 byte to be read
			flagSPI = SEND_STATE;
		}
		break;

	case SEND_STATE: //send the state+station
		if (spi1.SPI_Comm.RX_state == SPI_READY){
			delay(500000);
			SPI_Send(&spi1, message_spi, message_spi_length);
			flagSPI = READ_STATE;
		}
		break;

	case READ_STATE: //read RXNE to clear it off to avoid overrun
		if (spi1.SPI_Comm.TX_state == SPI_READY){
			delay(500000);
			SPI_Read(&spi1, &myRXbuffer, 1); //1 byte to be read (dummy read).
			flagSPI = WAIT_END;
		}
		break;

	case WAIT_END:
		if (spi1.SPI_Comm.RX_state == SPI_READY){
			delay(500000);
			//clear the flag of current state in order to capture state changes
			stateChanged = 0;
			//Disable SPI
			SPI_EnableDisable(&spi1,DISABLE);
			//get ready for the next state change
			flagSPI = SEND_PRINT;
		}
		break;
	default:
		//error. print it in semihosting
		break;

	}
}
